src/integ-test/bdd-test/features/flows/TestFlusso_closePaymentV2_ko_mandatoryFields_SPO_ko

Feature:  flow checks for closePayment-v2 request - closePayment-v2 KO (mandatory fields only) and sendPaymentOutcome KO [FLUSSO_CP_24]
 
  Background:
    Given systems up 
    And EC new version
    
   # verifyPaymentNotice phase
    Scenario: Execute verifyPaymentNotice request
    Given initial XML verifyPaymentNotice soap-request
    
    """
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
       <soapenv:Header/>
       <soapenv:Body>
          <nod:verifyPaymentNoticeReq>
             <idPSP>AGID_01</idPSP>
             <idBrokerPSP>97735020584</idBrokerPSP>
             <idChannel>97735020584_03</idChannel>
             <password>pwdpwdpwd</password>
             <qrCode>
                <fiscalCode>#creditor_institution_code#</fiscalCode>
                <noticeNumber>#notice_number#</noticeNumber>
             </qrCode>
          </nod:verifyPaymentNoticeReq>
       </soapenv:Body>
    </soapenv:Envelope>
    """
    
    When psp sends SOAP verifyPaymentNotice to nodo-dei-pagamenti
    Then check outcome is OK of verifyPaymentNotice response
    
   # activateIOPaymentReq phase
    Scenario: Execute activateIOPayment request
    Given initial XML activateIOPayment soap-request
	
    """
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForIO.xsd">
       <soapenv:Header/>
       <soapenv:Body>
          <nod:activateIOPaymentReq>
             <idPSP>AGID_01</idPSP>
             <idBrokerPSP>97735020584</idBrokerPSP>
             <idChannel>97735020584_03</idChannel>
             <password>pwdpwdpwd</password>
             <!--Optional:-->
             <idempotencyKey>#idempotency_key#</idempotencyKey>
             <qrCode>
                <fiscalCode>#creditor_institution_code#</fiscalCode>
                <noticeNumber>#notice_number#</noticeNumber>
             </qrCode>
             <!--Optional:-->
             <expirationTime>60000</expirationTime>
             <amount>10.00</amount>
             <!--Optional:-->
             <dueDate>2021-12-12</dueDate>
             <!--Optional:-->
             <paymentNote>responseFull</paymentNote>
             <!--Optional:-->
             <payer>
                <uniqueIdentifier>
                   <entityUniqueIdentifierType>G</entityUniqueIdentifierType>
                   <entityUniqueIdentifierValue>77777777777</entityUniqueIdentifierValue>
                </uniqueIdentifier>
                <fullName>IOname_#idempotency_key#</fullName>
                <!--Optional:-->
                <streetName>IOstreet</streetName>
                <!--Optional:-->
                <civicNumber>IOcivic</civicNumber>
                <!--Optional:-->
                <postalCode>IOcode</postalCode>
                <!--Optional:-->
                <city>IOcity</city>
                <!--Optional:-->
                <stateProvinceRegion>IOstate</stateProvinceRegion>
                <!--Optional:-->
                <country>IT</country>
                <!--Optional:-->
                <e-mail>IO.test.prova@gmail.com</e-mail>
             </payer>
          </nod:activateIOPaymentReq>
       </soapenv:Body>
    </soapenv:Envelope>
    """
        
    When psp sends SOAP activateIOPayment to nodo-dei-pagamenti
    Then check outcome is OK of activateIOPayment response
    
    # DB check_00
    # SELECT * FROM NODO_ONLINE.POSITION_ACTIVATE s where s.NOTICE_ID = '#notice_number#' and s.PA_FISCAL_CODE= '#creditor_institution_code#';
    # check POSITION_ACTIVATE.PAYMENT_TOKEN == $activateIOPaymentResponse.paymentToken and
    #       POSITION_ACTIVATE.PSP_ID == $activateIOPaymentRequest.idPSP
          
    # nodoChiediInformazioniPagamento phase
    Scenario: Execute a nodoChiediInformazioniPagamento request
    Given initial json nodoChiediInformazioniPagamento
    """
        {"idPagamento": "$activateIOPaymentResponse.paymentToken"}
    """
    When PM sends nodoChiediInformazioniPagamento to nodo-dei-pagamenti
    Then check errorCode is 200
    
    # closePayment-v2 request phase  
    Scenario: Execute a closePayment-v2 request
    Given initial json closePayment-v2
    """
        {"paymentTokens": [
            "$activateIOPaymentResponse.paymentToken"
            ],
            "outcome": "KO"
            }
    """

    When PM sends closePayment-v2 to nodo-dei-pagamenti
    Then check esito is OK 
    And check errorCode is 200
 
        
     # sendPaymentOutcomeReq phase
     Scenario: Execute sendPaymentOutcome request
     Given the closePayment-v2 scenario executed successfully
     Given initial XML sendPaymentOutcome
     """
     <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
       <soapenv:Header/>
       <soapenv:Body>
          <nod:sendPaymentOutcomeReq>
             <idPSP>70000000001</idPSP>
             <idBrokerPSP>70000000001</idBrokerPSP>
             <idChannel>70000000001_03</idChannel>
             <password>pwdpwdpwd</password>
             <paymentToken>$activateIOPaymentResponse.paymentToken</paymentToken>
             <outcome>KO</outcome>
             <!--Optional:-->
             <details>
                <paymentMethod>creditCard</paymentMethod>
                <!--Optional:-->
                <paymentChannel>app</paymentChannel>
                <fee>2.00</fee>
                <!--Optional:-->
                <payer>
                   <uniqueIdentifier>
                      <entityUniqueIdentifierType>G</entityUniqueIdentifierType>
                      <entityUniqueIdentifierValue>77777777777_01</entityUniqueIdentifierValue>
                   </uniqueIdentifier>
                   <fullName>SPOname_$activateIOPaymentResponse.paymentToken</fullName>
                   <!--Optional:-->
                   <streetName>SPOstreet</streetName>
                   <!--Optional:-->
                   <civicNumber>SPOcivic</civicNumber>
                   <!--Optional:-->
                   <postalCode>SPOpostal</postalCode>
                   <!--Optional:-->
                   <city>SPOcity</city>
                   <!--Optional:-->
                   <stateProvinceRegion>SPOstate</stateProvinceRegion>
                   <!--Optional:-->
                   <country>IT</country>
                   <!--Optional:-->
                   <e-mail>SPOprova@test.it</e-mail>
                </payer>
                <applicationDate>2021-12-12</applicationDate>
                <transferDate>2021-12-11</transferDate>
             </details>
          </nod:sendPaymentOutcomeReq>
       </soapenv:Body>
    </soapenv:Envelope>
    """
    
    When psp sends sendPaymentOutcome to nodo-dei-pagamenti
    Then check faultCode is PPT_TOKEN_SCONOSCIUTO
    And check description is 'token unknown'
    